<a href="https://colab.research.google.com/github/jshrma14/Google_colab_python/blob/main/Assignment_m9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import folium

In [2]:
df = pd.DataFrame({'float_col':[0.1,0.2,0.2,10.1,np.nan],'int_col':[1,2,6,8,-1],'str_col':['a','b',None,'a','c']})

In [3]:
df

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       a
4        NaN       -1       c

In [4]:
df[['float_col','int_col']]

   float_col  int_col
0        0.1        1
1        0.2        2
2        0.2        6
3       10.1        8
4        NaN       -1

In [8]:
df['float_col'].where(df['float_col']>0.15)

0     NaN
1     0.2
2     0.2
3    10.1
4     NaN
Name: float_col, dtype: float64

In [9]:
df['float_col'].where(df['float_col']==0.1)

0    0.1
1    NaN
2    NaN
3    NaN
4    NaN
Name: float_col, dtype: float64

In [11]:
df.where((df['float_col']>0.1) & (df['int_col']>2))

   float_col  int_col str_col
0        NaN      NaN     NaN
1        NaN      NaN     NaN
2        0.2      6.0    None
3       10.1      8.0       a
4        NaN      NaN     NaN

In [13]:
df.where(df['float_col']<0.1)

   float_col  int_col str_col
0        NaN      NaN     NaN
1        NaN      NaN     NaN
2        NaN      NaN     NaN
3        NaN      NaN     NaN
4        NaN      NaN     NaN

In [17]:
df2 = df
df2.columns = ['float_col','INT_col','str_col']

In [25]:
df2

   float_col  INT_col str_col
0        0.1        1       a
1        0.2        2       b
3       10.1        8       a

In [19]:
df.columns = ['float_col','INT_col','str_col']
df

   float_col  INT_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       a
4        NaN       -1       c

In [20]:
df.dropna(inplace=True)

In [21]:
df

   float_col  INT_col str_col
0        0.1        1       a
1        0.2        2       b
3       10.1        8       a

In [23]:
df2.float_col.fillna(df.float_col.mean(), inplace=True)

In [24]:
df2

   float_col  INT_col str_col
0        0.1        1       a
1        0.2        2       b
3       10.1        8       a

In [26]:
df['str_col'] = 'map_'+df['str_col']

In [27]:
df

   float_col  INT_col str_col
0        0.1        1   map_a
1        0.2        2   map_b
3       10.1        8   map_a

In [28]:
df.float_col.mean()

3.466666666666667

In [31]:
df.float_col.cov(df.INT_col)

21.583333333333336

In [32]:
df.corr()

           float_col   INT_col
float_col   1.000000  0.992353
INT_col     0.992353  1.000000

In [33]:
other = pd.DataFrame({'some_val':[1,2],'str_col':['a','b']})
other

   some_val str_col
0         1       a
1         2       b

In [37]:
df1 = f = pd.DataFrame({'float_col':[0.1,0.2,0.2,10.1,np.nan],'int_col':[1,2,6,8,-1],'str_col':['a','b',None,'a','c']})

In [38]:
df1

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       a
4        NaN       -1       c

In [43]:
# File handling......

df = open('Names.txt',mode='w')

In [44]:
df.writelines('Anil\nSunita\nSuman\nLokesh\nSumita\nJohn\nJohny')

In [45]:
df.close()

In [46]:
# File handling......

body = open('body.txt',mode='w')

body.writelines(' I am going to Delhi. Let’s meet on 7th Jan 2018.\nHave a great day!\n\nRegards,\nTeam Victory')

In [47]:
body.close()

In [58]:
# main program...

In [49]:
f = open('Names.txt')

In [50]:
f.readlines()

['Anil\n', 'Sunita\n', 'Suman\n', 'Lokesh\n', 'Sumita\n', 'John\n', 'Johny']

In [59]:
f.seek(0)

0

In [61]:
names = f.readlines()

In [62]:
names

['Anil\n', 'Sunita\n', 'Suman\n', 'Lokesh\n', 'Sumita\n', 'John\n', 'Johny']

In [63]:
fnm = [i.strip() for i in names]

In [64]:
fnm

['Anil', 'Sunita', 'Suman', 'Lokesh', 'Sumita', 'John', 'Johny']

In [65]:
f.close()

In [66]:
bf = open('body.txt')
bf.read()

' I am going to Delhi. Let’s meet on 7th Jan 2018.\nHave a great day!\n\nRegards,\nTeam Victory'

In [67]:
bf.close()

In [70]:
for i in fnm:
  nm = i + '.txt'
  f = open(nm,mode='w')
  messg = 'Hello '+i+'\nI am going to Delhi. Let’s meet on 7th Jan 2018.\nHave a great day!\n\nRegards,\nTeam Victory'
  f.writelines(messg)
  f.close()